const harakat_prep = s => new RegExp(s.replace(/(\S)/g, '$1[ً-ْ]*'), 'g');
const en_nums = s => s.split('').map(c => c.codePointAt(0) - 0x660).join('');
const repls = [
    ['تبديل العبارات برموزها', [
            ['ﷺ', [harakat_prep('صلى الله عليه وسلم'), 'ﷺ']],
            ['- ﷺ - ➔ ﷺ', [[/- ?ﷺ/g, 'ﷺ'], [/ﷺ ?-/g, 'ﷺ']]],
            ['﷽', [harakat_prep('بسم الله الرحمن الرحيم'), '﷽'], 0],
            ['ﷻ', [harakat_prep('جل جلاله'), 'ﷻ']],
        ],
    ],
    ['علامات الترقيم', [
            ['تحويل علامات الترقيم للعربية', [[/,/g, '،'], [/;/g, '؛'], [/\?/g, '؟']]],
            ['حذف المسافات الفضْلة مع علامات الترقيم', [[/ +([\)﴾»،:؛\n])/g, '$1'], [/([\(﴿«]) +/g, '$1']]],
            ['حذف المسافات قبل النقطة', [/ +\.(?!\.)/g, '.']],
            [' ـ  ➔  - ', [/ [ـ_] /g, ' - ']],
            ['؛ ➔ ،', [/؛/g, '،'], 0],
            ['% ➔ ٪', [/%([^\d]|$)/g, '٪$1'], 0],
            ['... ➔ …', [/\.\.\./g, '…']],
            ['حذف علامة تركيق مكرر (نحو !! و؟.)', [[/؟\./g, '؟'], [/؟؟+/g, '؟'], [/!!+/g, '!']]],
            ['123 ➔ ١٢٣', [[/[0-9]/g, d => '٠١٢٣٤٥٦٧٨٩'.substr(+d, 1)], [/([٠-٩]+)(\u20E3)/g, (m, g1, g2) => en_nums(g1) + g2]]],
            ['١٢٣ه -> ١٢٣ هـ', [/([٠-٩]+) ?هـ?([ .]|$)/g, '$1 هـ$2']],
            ['(ت: ٢٠٠) ➔ (ت ٢٠٠)', [/\(ت:? ?([٠-٩]+)\)/g, '(ت $1)']],
            ['[الفاتحة: ١] ➔ [الفاتحة ١]', [/\[([ء-ْ ]{1,11}): ([٠-٩، -]+)\]/g, '[$1 $2]']],
            ['حذف التطويل (ـ)', [/ـ/g, ''], 0],
        ],
    ],
    ['أقواس', [
            ['"" ➔ «»', [/" *([\s\S]*?) *"/g, '«$1»']],
            ["'' ➔ ‹›", [/' *([\s\S]*?) *'/g, '‹$1›'], 0],
            ['(()) ➔ «»', [/\(\(([\s\S]*?)\)\)/g, '«$1»']],
            ['{} ➔ ﴿﴾', [/\{ *([\s\S]*?) *}/g, '﴿$1﴾']],
            ['و ( ➔ و( • ك( ➔ كـ(', [/(^|\s)([وفكبل][َِ]?) ?([(«﴾])/g, (m, g1, g2, g3) => g1 + g2 + (g2.includes('و') ? '' : 'ـ') + g3]],
        ],
    ],
    ['مسافات', [
            ['حذف مسافات فضلة', [/[ \t]+\n/g, '\n']],
            ['حذف مسافات مكررة', [/([^\n ])  +/g, '$1 ']],
            ['حذف المسافات القبلية', [/(^|\n) +/g, '\n'], 0],
            ['حذف سطور فارغة فضلة', [/\n\n+/g, '\n\n']],
            ['حذف حروف لا تظهر تغير جهة النص', [/[\u202C\u200E]/g, '']], // ZWJ, LRM
            ['حذف المسافة بعد واو العطف', [/(^| )(وَ?) /g, '$1$2']],
        ],
    ],
    ['حركات وحروف', [
            ['نقل تنوين الفتح قبل الألف', [/اً/g, 'ًا']],
            ['حذف الحركات الفضْلة', [[/َ([اى])/g, '$1'], [/(([^ء-ْ]|^)وَ)|إِ|أَ|الْ|[أإ]نَّ|م[َِ]نْ/g, m => m.slice(0, -1)]]],
            ['نقل الشدة قبل الحركة', [/([ً-ِْ])ّ/g, 'ّ$1']],
            ['حذف الحركات التي ليست بعد حرف', [/([^ء-يیّ])[ً-ْ]+/g, '$1']],
            ['حذف السكون على حرفي المد', [/(ِي|ُو)ْ/g, m => m.slice(0, -1)]],
            ['ىٰ ➔ ى', [/ىٰ/g, 'ى']],
            ['ابو ➔ أبو', [/(^| )(و?َ?)ا(ب[وي])/g, '$1$2أ$3']],
            ['عبدالله ➔ عبد الله', [/(^| )(و?َ?عبدال)/g, '$1$2 ']],
        ],
    ],
];
export default repls;
